publish/400-Meaning-兴趣/450-Emacs-神之编辑器/Emacs Gnus 多SMTP账户邮件发送配置及问题解决.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<!-- 2021-10-02 Sat 10:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu Peng" />
<link rel='stylesheet' type='text/css' href='file:///home/paul/mynotes/publish/css/org.css' /><link rel='stylesheet' type='text/css' href='file:///home/paul/mynotes/publish/css/header.css' />
</head>
<body>
<div id="preamble" class="status">
<div class="site_header"><div class="site_title" ><div class="title_main">WuPeng's Notes - 我的知识库</div><div class="title_sub">不积跬步，无以至千里；不积小流，无以成江海</div><div class="search"></div></div><div class="nav_bar"><ul><li><a href="file:///home/paul/mynotes/publish/index.html">笔记</a></li><li><a href="file:///home/paul/mynotes/publish/inbox.html">收集</a></li><li><a href="#contact">Contact</a></li><li style="float:right"><a href="file:///home/paul/mynotes/publish/about.html">关于</a></li></ul></div></div>
</div>
<div id="content">
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#目录">1. 目录</a></li>
<li><a href="#orgdef7ec2">2. 1 需求</a></li>
<li><a href="#org383ccdc">3. 2 环境</a></li>
<li><a href="#org68a5310">4. 3 问题及解决方法</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf7015b3" class="outline-2">
<h2 id="目录"><span class="section-number-2">1</span> 目录</h2>
<div class="outline-text-2" id="text-目录">
<ul class="org-ul">
<li><a href="#orgdef7ec2">1. 需求</a></li>
<li><a href="#org383ccdc">2. 环境</a></li>
<li><a href="#org68a5310">3. 问题及解决方法</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9e20dbe" class="outline-2">
<h2 id="orgdef7ec2"><span class="section-number-2">2</span> 1 需求</h2>
<div class="outline-text-2" id="text-orgdef7ec2">
<p>
在Emacs 上收发邮件，收邮件用IMAP 访问，发邮件用SMTP
</p>
</div>
</div>

<div id="outline-container-org7180b0c" class="outline-2">
<h2 id="org383ccdc"><span class="section-number-2">3</span> 2 环境</h2>
<div class="outline-text-2" id="text-org383ccdc">
<p>
Linux Debian stretch Emacs 26 Gnus
</p>
</div>
</div>

<div id="outline-container-org7eadcaf" class="outline-2">
<h2 id="org68a5310"><span class="section-number-2">4</span> 3 问题及解决方法</h2>
<div class="outline-text-2" id="text-org68a5310">
<p>
网络上有许多文章介绍如何设置，大多数应该可以工作，但我喜欢打破沙锅问到底，找来的
配置也要看看是不是有必要。
</p>

<p>
收邮件用 nnimap 后端，可以查看 Emacs Gnus 手册。
</p>

<p>
单个SMTP账户的也好弄，可以网络搜索。
</p>

<p>
关于多账户的要说两句，大多数采用的是
<a href="https://www.emacswiki.org/emacs/MultipleSMTPAccounts">MultipleSMTPAccounts</a>
上介绍的方式，定义一个 change-smtp 的函数，并且在smtpmail-via-smtp
中调用它。
</p>

<pre class="example">
(defadvice smtpmail-via-smtp
    (before smtpmail-via-smtp-ad-change-smtp (recipient smtpmail-text-buffer ))
  "Call `change-smtp' before every `smtpmail-via-smtp'."
  (with-current-buffer smtpmail-text-buffer (change-smtp)))

(ad-activate 'smtpmail-via-smtp)
</pre>

<p>
如果你的目录下有 .authinfo .authinfo.gpg .netrc
中的一个，并且有登录对应的服务器
的用户名和密码的话，发送邮件完全没有问题。否则的话可能会出现
<b>参数个数不对</b> 的问 题。
</p>

<blockquote>
<p>
apply: Wrong number of arguments: #[(ad&#x2013;addoit-function recipient
smtpmail-text-buffer) smtpmail-text-buffer ad&#x2013;addoit-function
recipient nil change-smtp] 5], 4 M
</p>
</blockquote>

<p>
原因在于上面这段代码中，在 smtpmail.el 中它的定义是这新的：
</p>

<pre class="example">
(defun smtpmail-via-smtp (recipient smtpmail-text-buffer
                    &amp;optional ask-for-password)
)
</pre>

<p>
少了这最后的可选参数为什么会发送不出去呢？可以从 smtpmail.el
中找答案。它的流程
是这样的：默认情况下直接尝试与邮件服务器建立连接，然后分析服务器的响应代码，只有
收到 530 或者 550 错误的时候才会使用 ask-for-password =&gt; t 调用
smtpmail-try-auth-methods ，向服务器发送用户名和密码。而
smtpmail-try-auth-methods 会首先去找 auth-source
变量中定义的文件，默认就是前文
提到的那几个文件，在其中查找用户名和密码，如果没有才会向用户询问。
</p>

<p>
所以针对 Emacs 26.3 (其他版本未检查)，EmacsWiki
上的设置有些地方是没有必要的，比 如 smtp-accounts
中就完全没有必要写密码了，也不安全。 set-smtp 和 set-smtp-ssl
这两个函数中的如下两个变量设置完全没有必要。
</p>

<pre class="example">
(setq smtpmail-auth-credentials (list (list server port user password)) smtpmail-starttls-credentials (list (list server port key cert)))
</pre>

<p>
完成设置后，可以测试一下。 Enjoy Emacs! 以下是我修改后的发送邮件的配置。
</p>

<pre class="example">
;; Available SMTP accounts. The format is type of connection - account pattern
;; in the from field - smtp server - port. The user name and password need in
;; ~/.authinfo for smtp server. This variable will be used in function chang-smtp,
;; if from address include the ACCOUNT PATTERN, then send mail through SMTP SERVER.
(defvar smtp-accounts
  '((ssl "@gmail.com" "smtp.gmail.com" 587 )))

;; Now lets configure smtpmail.el with your name and functions to send
;; mail using your smtp accounts by changing the from field
(require 'smtpmail)
(setq send-mail-function 'smtpmail-send-it
      message-send-mail-function 'smtpmail-send-it
      mail-from-style nil
      smtpmail-debug-info t
      smtpmail-debug-verb t)

(defun set-smtp (mech server port)
  "Set related SMTP variables for supplied parameters."
  (setq smtpmail-smtp-server server smtpmail-smtp-service port
        smtpmail-auth-supported (list mech)
        )
  (message "Setting SMTP server to `%s:%s'." server port))

(defun set-smtp-ssl (server port)
  "Set related SMTP and SSL variables for supplied parameters."
  (setq starttls-use-gnutls t
        ;starttls-gnutls-program "gnutls-cli"
        ;; If you set starttls-use-gnutls as t, It means use gnutls-cli but
        ;; starttls command tool. Of course ,you need install gnutls first on
        ;; your OS.
        starttls-extra-arguments nil
        smtpmail-smtp-server server
        smtpmail-smtp-service port
        )
  (message "Setting SMTP server to `%s:%s'. (SSL enabled.)" server port ))


(defun change-smtp ()
  "Change the SMTP server according to the current from line."
  (save-excursion
    (loop with from = (save-restriction
                        (message-narrow-to-headers)
                        (message-fetch-field "from"))
          for (auth-mech address . auth-spec) in smtp-accounts
          when (string-match address from) do (cond
                                               ((memq auth-mech '(cram-md5 plain login))
                                                (return (apply 'set-smtp (cons auth-mech auth-spec))))
                                               ((eql auth-mech 'ssl)
                                                (return (apply 'set-smtp-ssl auth-spec)))
                                               (t (error "Unrecognized SMTP auth. mechanism:`%s'." auth-mech))) finally (error "Cannot infer SMTP information."))))

;; The previous function will complain if you fill the from field with
;; an account not present in smtp-accounts.

(defadvice smtpmail-via-smtp
    (before smtpmail-via-smtp-ad-change-smtp (recipient smtpmail-text-buffer &amp;optional ask_for_password))
  "Call `change-smtp' before every `smtpmail-via-smtp'."
  (with-current-buffer smtpmail-text-buffer (change-smtp)))

(ad-activate 'smtpmail-via-smtp)

;; This wraps send mail via smtp mail, to be able to send multiple
;; messages with smtpmail.
</pre>

<p>
本作品采用<a href="http://creativecommons.org/licenses/by-nc-nd/3.0/deed.zh">知识共享署名-非商业性使用-禁止演绎
3.0 未本地化版本许可协议</a> 进行许可。
</p>
</div>
</div>
</div>
</body>
</html>